[
  {
    "id": 1746990076648,
    "title": "My Journey to Christ: A Testimony of Grace",
    "content": "I didn’t grow up with a strong foundation in faith. I knew of God, but I didn’t truly know Him. For years, I searched for meaning in the wrong places—chasing validation, success, and fleeting happiness. But nothing filled the emptiness inside.\n\nThen one day, God met me where I was—broken, confused, and tired of pretending to be okay. It wasn’t a dramatic moment, but a quiet realization: I needed Him. I opened my heart, picked up a Bible, and began seeking Jesus. The more I read, prayed, and surrendered, the more my life changed.\n\nGod didn’t fix everything overnight, but He gave me peace, purpose, and identity. He showed me love that doesn’t depend on my performance, grace that covers my mistakes, and a new life built on hope. I’m still growing, still learning, but I know now—I’m never walking alone.\n\nIf He can change my life, He can change yours too. Jesus is real. His love is real. And He’s waiting with open arms.",
    "authorUsername": "bbarbosa"
  },
  {
    "id": 1746990177785,
    "title": "How I Found God for Real",
    "content": "I used to think being a Christian just meant going to church, praying sometimes, and trying to be a “good person.” But deep down, I was struggling — with self-worth, anxiety, and constantly comparing myself to everyone around me. I smiled a lot, but I felt empty inside.\n\nI tried to fill the void with people, achievements, social media — but nothing lasted. I kept hitting the same wall until I finally whispered a real prayer: “God, if You’re real… show me.”\n\nAnd He did.\n\nNot with a loud voice or lightning bolt, but through peace in the middle of my anxiety. Through random verses that felt like they were written just for me. Through people who reminded me of God’s love when I felt unlovable.\n\nI started reading the Bible with a new lens. Worship hit differently. I realized that God wasn’t looking for perfection — He wanted my heart.\n\nMy life isn’t perfect now, but I finally know who I belong to. I’ve found confidence, healing, and purpose in Jesus — and I’m never going back.\n\nThis is my come up. And it’s only by His grace.",
    "authorUsername": "nsantos"
  }
]